
shop = [['каретка', 1200], ['шатун', 1000], ['седло', 300],
        ['педаль', 100], ['седло', 1500], ['рама', 12000],
        ['обод', 2000], ['шатун', 200], ['седло', 2700]]

good = input('Введите название детали: ')
a = 0
val_price = 0
for i in range(len(shop)):
        if shop[i][0] == good:
                a += 1
                val_price += shop[i][1]
if a ==0:
        print('Такой детали нет в списке')
else:
        print('\nНазвание детали: ', good)
        print('Кол - во деталей: ', a)
        print('Общая стоимость: ', val_price)

